//#include "stdafx.h"
#include <stdlib.h>
#include <iostream>
#include <ctime>
using namespace std;
void show(char a[7][7])
{
	cout << "\n                                                               ";
	for (int q = 1; q < 6; q++) {
		for (int w = 1; w < 6; w++)
			cout << a[q][w];
		cout << "\n                                                               ";
	}
	cout << endl;
}
int krdnt()
{
	int a;
	bool vse_norm = 1;
	do
	{
		vse_norm = 1;
		cin >> a;
		switch (a)
		{
		case 1: { a = 1; break; }
		case 2: { a = 3; break; }
		case 3: { a = 5; break; }
		default:
		cout << "Неверное значение\nВведите  значение от 1 до 3 \n";
			vse_norm = 0;
			break;
		}

	} while (vse_norm == 0);
	return a;
}
int check(char b[7][7])
{

	for (int e = 1; e < 6; e += 2)//все горизонтали проверка на Х
		if ((b[e][1] == 'X') && (b[e][3] == 'X') && (b[e][5] == 'X')) return 1;
	for (int r = 1; r < 6; r += 2)//все вертикали проверка на Х
		if ((b[1][r] == 'X') && (b[3][r] == 'X') && (b[5][r] == 'X')) return 1;
	//диагонали проверка на Х
	if ((b[1][1] == 'X') && (b[3][3] == 'X') && (b[5][5] == 'X')) return 1;
	if ((b[1][5] == 'X') && (b[3][3] == 'X') && (b[5][1] == 'X')) return 1;
	for (int e = 1; e < 6; e += 2)//все горизонтали проверка на О
		if ((b[e][1] == 'O') && (b[e][3] == 'O') && (b[e][5] == 'O')) return 2;
	for (int r = 1; r < 6; r += 2)//все вертикали проверка на О
		if ((b[1][r] == 'O') && (b[3][r] == 'O') && (b[5][r] == 'O')) return 2;
	// диагонали проверка на О
	if ((b[1][1] == 'O') && (b[3][3] == 'O') && (b[5][5] == 'O')) return 2;
	if ((b[1][5] == 'O') && (b[3][3] == 'O') && (b[5][1] == 'O')) return 2;
        return 3;
}
int main()
{
	srand(time(NULL));
	setlocale(LC_ALL, "RU");
	int i = 0, j = 0, ii = 0;
	char g[7][7];
	bool ese=1;
	cout << "Привет\n";
	do
	{
		// рисуем решеточку
		for (i = 1; i < 6; i++)
		{
			for (j = 1; j < 6; j++)
			{
				if ((i % 2) == 0) g[i][j] = '-';
				if ((j % 2) == 0) g[i][j] = '|';
				if (((i % 2) != 0) && ((j % 2) != 0)) g[i][j] = ' ';
			}
		}
		show(g);
		// спрашиваем режим игры
		while (1)
		{
			cout << "_______________________________________________________________________________\n";
			cout << "Играть с другом                  :0\n";
			cout << "_______________________________________________________________________________\n";
			cout << "Играть с тупым компухтером       :1\n";
			cout << "_______________________________________________________________________________\n";
			cout << "Играть с искусивенным интелектом :2  ( вероятность выигрыша 0 % )\n";
			cout << "_______________________________________________________________________________\n";
			cout << "Выход                            :3\n";
			cout << "_______________________________________________________________________________\n";
			cin >> ii;
			if ((ii <= 3) && (ii > -1)) break;
			else cout << "Нет такого варианта\n";
		}
		if (ii != 3)
		{
			// первый ход ИИ
			if (ii == 2)
			{
				g[3][3] = 'X';
				show(g);
			}
			// первый ход 
			cout << ((ii == 2) ? "" : "Начинает O\n");
			cout << "\nВведте строку   :";
			i = krdnt();
			cout << "Введите столбец :";
			j = krdnt();
			g[i][j] = 'O';
			// вывод
			show(g);
			// цикл игры
			for (int x = 1; x < 5; x++)
			{
				// игра с другом
				if (ii == 0)
				{
					cout << "\nТеперь Х\n";
					while (1)
					{
						cout << "Введте строку   :";
						i = krdnt();
						cout << "Введите столбец :";
						j = krdnt();
						if (g[i][j] == ' ')
						{
							g[i][j] = 'X'; break;
						}
						else cout << "\nКлетка уже занята\n";
					}
				}
				// ии рандом
				if (ii == 1)
				{
					while (1)
					{
						// делаем рандом из чисел 1 3 и 5
						i = (rand() % 5 + 1); if ((i % 2) == 0)i--;
						j = (rand() % 5 + 1); if ((j % 2) == 0)j--;
						if (g[i][j] == ' ')
						{
							g[i][j] = 'X'; break;
						}
					}
				}
				// ии суперинтелект
				if (ii == 2)
				{	
					// основа кресты 1
					if ((i == 1) && (j == 3))
					{
						g[5][1] = 'X'; show(g);
						while (1)// ход игрока 1
						{
							cout << "Введте строку   :";
							i = krdnt();
							cout << "Введите столбец :";
							j = krdnt();
							if (g[i][j] == ' ') break;
							else cout << "\nКлетка уже занята\n";
						}
						g[i][j] = 'O';
						show(g);
						if ((i == 1) && (j == 5))
						{
							g[1][1] = 'X'; show(g);
							while (1)// ход игрока 2
							{
								cout << "Введте строку   :";
								i = krdnt();
								cout << "Введите столбец :";
								j = krdnt();
								if (g[i][j] == ' ') break;
								else cout << "\nКлетка уже занята\n";
							}
							g[i][j] = 'O';
							show(g);
							if ((i == 3) && (j == 1)) { g[5][5] = 'X'; i = 0; j = 0; }//победа
							else { g[3][1] = 'X'; i = 0; j = 0; }//победа
						}
						else { g[1][5] = 'X'; i = 0; j = 0; }// победа
					}
					// кресты поворот 
					if ((i == 3) && (j == 1))
					{
						g[5][5] = 'X'; show(g);
						while (1)// ход игрока 1
						{
							cout << "Введте строку   :";
							i = krdnt();
							cout << "Введите столбец :";
							j = krdnt();
							if (g[i][j] == ' ') break;
							else cout << "\nКлетка уже занята\n";
						}
						g[i][j] = 'O';
						show(g);
						if ((i == 1) && (j == 1))
						{
							g[5][1] = 'X'; show(g);
							while (1)// ход игрока 2
							{
								cout << "Введте строку   :";
								i = krdnt();
								cout << "Введите столбец :";
								j = krdnt();
								if (g[i][j] == ' ') break;
								else cout << "\nКлетка уже занята\n";
							}
							g[i][j] = 'O';
							show(g);
							if ((i == 5) && (j == 3)) { g[1][5] = 'X'; i = 0; j = 0; }//победа
							else { g[5][3] = 'X'; i = 0; j = 0; }//победа 
						}
						else { g[1][1] = 'X'; i = 0; j = 0; }// победа
					}
					// кресты поворот
					if ((i == 5) && (j == 3))
					{
						g[1][5] = 'X'; show(g);
						while (1)// ход игрока 1
						{
							cout << "Введте строку   :";
							i = krdnt();
							cout << "Введите столбец :";
							j = krdnt();
							if (g[i][j] == ' ') break;
							else cout << "\nКлетка уже занята\n";
						}
						g[i][j] = 'O';
						show(g);
						if ((i == 5) && (j == 1))
						{
							g[5][5] = 'X'; show(g);
							while (1)// ход игрока 2
							{
								cout << "Введте строку   :";
								i = krdnt();
								cout << "Введите столбец :";
								j = krdnt();
								if (g[i][j] == ' ') break;
								else cout << "\nКлетка уже занята\n";
							}
							g[i][j] = 'O';
							show(g);
							if ((i == 3) && (j == 5)) { g[1][1] = 'X'; i = 0; j = 0; }//победа
							else { g[3][5] = 'X'; i = 0; j = 0; }//победа
						}
						else { g[5][1] = 'X'; i = 0; j = 0; }// победа
					}
					//кресты поворот
					if ((i == 3) && (j == 5))
					{
						g[1][1] = 'X'; show(g);
						while (1)// ход игрока 1
						{
							cout << "Введте строку   :";
							i = krdnt();
							cout << "Введите столбец :";
							j = krdnt();
							if (g[i][j] == ' ') break;
							else cout << "\nКлетка уже занята\n";
						}
						g[i][j] = 'O';
						show(g);
						if ((i == 5) && (j == 5))
						{
							g[1][5] = 'X'; show(g);
							while (1)// ход игрока 2
							{
								cout << "Введте строку   :";
								i = krdnt();
								cout << "Введите столбец :";
								j = krdnt();
								if (g[i][j] == ' ') break;
								else cout << "\nКлетка уже занята\n";
							}
							g[i][j] = 'O';
							show(g);
							if ((i == 1) && (j == 3)) { g[5][1] = 'X'; i = 0; j = 0; }//победа
							else { g[1][3] = 'X'; i = 0; j = 0; }//победа
						}
						else { g[5][5] = 'X'; i = 0; j = 0; }// победа
					}
					// основа диагонали 1 
					if ((i == 1) && (j == 1))
					{
						g[1][5] = 'X';
						show(g);
						while (1)// ход игрока
						{
							cout << "Введте строку   :";
							i = krdnt();
							cout << "Введите столбец :";
							j = krdnt();
							if (g[i][j] == ' ') break;
							else cout << "\nКлетка уже занята\n";
						}
						g[i][j] = 'O';
						show(g);
						// этап 2
						if ((i == 5) && (j == 1))
						{
							g[3][1] = 'X'; show(g);
							while (1)// ход игрока
							{
								cout << "Введте строку   :";
								i = krdnt();
								cout << "Введите столбец :";
								j = krdnt();
								if (g[i][j] == ' ') break;
								else cout << "\nКлетка уже занята\n";
							}
							g[i][j] = 'O';
							show(g);
							if ((i == 3) && (j == 5))
							{
								g[1][3] = 'X'; show(g);
								while (1)// ход игрока
								{
									cout << "Введте строку   :";
									i = krdnt();
									cout << "Введите столбец :";
									j = krdnt();
									if (g[i][j] == ' ') break;
									else cout << "\nКлетка уже занята\n";
								}
								g[i][j] = 'O';
								show(g);
								if ((i == 5) && (j == 3)) { g[5][5] = 'X'; show(g); break; }// ничья
								else { g[5][3] = 'X'; i = 0; j = 0; }// победа
							}
							else { g[3][5] = 'X';  i = 0; j = 0; }// победа
						}
						else { g[5][1] = 'X'; i = 0; j = 0; }// победа
					}
					// диагонали поворот
					if ((i == 1) && (j == 5))
					{
						g[5][5] = 'X';
						show(g);
						while (1)// ход игрока
						{
							cout << "Введте строку   :";
							i = krdnt();
							cout << "Введите столбец :";
							j = krdnt();
							if (g[i][j] == ' ') break;
							else cout << "\nКлетка уже занята\n";
						}
						g[i][j] = 'O';
						show(g);
						// этап 2
						if ((i == 1) && (j == 1))
						{
							g[1][3] = 'X'; show(g);
							while (1)// ход игрока
							{
								cout << "Введте строку   :";
								i = krdnt();
								cout << "Введите столбец :";
								j = krdnt();
								if (g[i][j] == ' ') break;
								else cout << "\nКлетка уже занята\n";
							}
							g[i][j] = 'O';
							show(g);
							if ((i == 5) && (j == 3))
							{
								g[3][5] = 'X'; show(g);
								while (1)// ход игрока
								{
									cout << "Введте строку   :";
									i = krdnt();
									cout << "Введите столбец :";
									j = krdnt();
									if (g[i][j] == ' ') break;
									else cout << "\nКлетка уже занята\n";
								}
								g[i][j] = 'O';
								show(g);
								if ((i == 3) && (j == 1)) { g[5][1] = 'X'; show(g); break; }// ничья
								else { g[3][1] = 'X'; i = 0; j = 0; }// победа
							}
							else { g[5][3] = 'X';  i = 0; j = 0; }// победа
						}
						else { g[1][1] = 'X'; i = 0; j = 0; }// победа
					}
					// диагонали поворот
					if ((i == 5) && (j == 5))
					{
						g[5][1] = 'X';
						show(g);
						while (1)// ход игрока
						{
							cout << "Введте строку   :";
							i = krdnt();
							cout << "Введите столбец :";
							j = krdnt();
							if (g[i][j] == ' ') break;
							else cout << "\nКлетка уже занята\n";
						}
						g[i][j] = 'O';
						show(g);
						// этап 2
						if ((i == 1) && (j == 5))
						{
							g[3][5] = 'X'; show(g);
							while (1)// ход игрока
							{
								cout << "Введте строку   :";
								i = krdnt();
								cout << "Введите столбец :";
								j = krdnt();
								if (g[i][j] == ' ') break;
								else cout << "\nКлетка уже занята\n";
							}
							g[i][j] = 'O';
							show(g);
							if ((i == 3) && (j == 1))
							{
								g[5][3] = 'X'; show(g);
								while (1)// ход игрока
								{
									cout << "Введте строку   :";
									i = krdnt();
									cout << "Введите столбец :";
									j = krdnt();
									if (g[i][j] == ' ') break;
									else cout << "\nКлетка уже занята\n";
								}
								g[i][j] = 'O';
								show(g);
								if ((i == 1) && (j == 3)) { g[1][1] = 'X'; show(g); break; }// ничья
								else { g[1][3] = 'X'; i = 0; j = 0; }// победа
							}
							else { g[3][1] = 'X';  i = 0; j = 0; }// победа
						}
						else { g[1][5] = 'X'; i = 0; j = 0; }// победа
					}
					// диагонали поворот
					if ((i == 5) && (j == 1))
					{
						g[1][1] = 'X';
						show(g);
						while (1)// ход игрока
						{
							cout << "Введте строку   :";
							i = krdnt();
							cout << "Введите столбец :";
							j = krdnt();
							if (g[i][j] == ' ') break;
							else cout << "\nКлетка уже занята\n";
						}
						g[i][j] = 'O';
						show(g);
						// этап 2
						if ((i == 5) && (j == 5))
						{
							g[5][3] = 'X'; show(g);
							while (1)// ход игрока
							{
								cout << "Введте строку   :";
								i = krdnt();
								cout << "Введите столбец :";
								j = krdnt();
								if (g[i][j] == ' ') break;
								else cout << "\nКлетка уже занята\n";
							}
							g[i][j] = 'O';
							show(g);
							if ((i == 1) && (j == 3))
							{
								g[3][1] = 'X'; show(g);
								while (1)// ход игрока
								{
									cout << "Введте строку   :";
									i = krdnt();
									cout << "Введите столбец :";
									j = krdnt();
									if (g[i][j] == ' ') break;
									else cout << "\nКлетка уже занята\n";
								}
								g[i][j] = 'O';
								show(g);
								if ((i == 3) && (j == 5)) { g[1][5] = 'X'; show(g); break; }// ничья
								else { g[3][5] = 'X'; i = 0; j = 0; }// победа
							}
							else { g[1][3] = 'X';  i = 0; j = 0; }// победа
						}
						else { g[5][5] = 'X'; i = 0; j = 0; }// победа
					}
				}
				//вывод
				show(g);
				// проверка на победу  Х
				if (check(g) == 1)
				{
					cout << "Победа \n" << "                                                              X" << "   " << "X" << "   " << "X" << "\n";
					break;
				}
				// ход игрока (O)
				cout << "\nТеперь O\n";
				while (1)
				{
					cout << "Введте строку   :";
					i = krdnt();
					cout << "Введите столбец :";
					j = krdnt();
					if (g[i][j] == ' ') break;
					else cout << "\nКлетка уже занята\n";
				}
				g[i][j] = 'O';
				show(g);
				// проверка на победу О
				if (check(g) == 2)
				{
					cout << "\n                                                               Победа \n" << "                                                              O" << "   " << "O" << "   " << "O" << "\n";
					break;
				}
			}
			// проверка на ничью после всех ходов
			if ((check(g)== 3)) cout << "                                                               Ничья.";
			cout << "\n\n\n                                                               гейм овер\n\n\n";
		}
                if (ii!=3)
                {
		   cout << " Уходишь?\n 0 - HET\n 1 - DA\n ";
		   cin >> ese;
                } else ese = 1;
	} while (ese == 0);
	cout << "Бывай!\n";
	return 0;
}
